controllers/SiteController.php

    public function actionIndex()
    {
        $key = Yii::$app->request->get('key');
        if($key) {
            $user = User::findByAuthKey($key);
            if($user && $user->status == 0) {
                $user->status = 1;
                $user->save();
---
UPDATE `user` SET `status`=1, `updated_at`=1521673344 WHERE `id`=3

    public function actionProfile()
    {

        if(Yii::$app->user->isGuest) {
            return $this->goHome();
        } else {
            $action = Yii::$app->request->get('action');
            $userId = Yii::$app->user->id;
            $user = User::findIdentity($userId);
            if($action && $action == 'delete') {
                Yii::$app->user->logout();
                $user->delete();
                return $this->goHome();
            } else {
                $model = new ProfileForm();
                if ($model->load(Yii::$app->request->post()) && $model->validate()) {
                    $post = Yii::$app->request->post('ProfileForm');
                    $user->firstName = $post['firstName'];
                    $user->lastName = $post['lastName'];

                    if(!empty($post['password'])) {
                        $user->setPassword($post['password']);
                    }
                    if ($user->save()) {
---
UPDATE `user` SET `firstName`=NULL, `lastName`=NULL, `updated_at`=1521675153 WHERE `id`=3