models/User.php

    public static function findByAuthKey($auth_key)
    {
        return static::findOne(['auth_key' => $auth_key]);
---
SELECT * FROM `user` WHERE `auth_key`='Cr4g22hCzKDEnqnXPts8G5-owcdtCp7_'

    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email]);
---
SELECT * FROM `user` WHERE `email`='mayuroff@yandex.ru'